In [1]:
#

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv("C:\\Users\\Admin\\OneDrive\\Desktop\\DA\\BillionairesIndex.csv")
df

,Rank,Name,Total_Net_Worth,LastChange,YTDChange,Country,Industry
0,1,Elon Musk,$311B,+$9.32B,+$141B,UnitedStates,Technology
1,2,Jeff Bezos,$195B,-$3.79B,+$5.06B,UnitedStates,Technology
2,3,Bernard Arnault,$167B,-$544M,+$52.7B,France,Consumer
3,4,Bill Gates,$136B,+$906M,+$4.40B,UnitedStates,Technology
4,5,Larry Page,$131B,+$1.71B,+$48.7B,UnitedStates,Technology
...,...,...,...,...,...,...,...
495,496,Barry Diller,$5.92B,-$73.5M,+$366M,UnitedStates,Technology
496,497,Cliff Obrecht,$5.89B,$0,+$4.99B,Australia,Services
497,498,Melanie Perkins,$5.89B,$0,+$4.99B,Australia,Services
498,499,Trevor Rees-Jones,$5.89B,-$106M,+$898M,UnitedStates,Energy
499,500,Frits Goldschmeding,$5.88B,-$90.7M,+$621M,Netherlands,Retail

In [4]:
print("The info about the table is : ")
df.info()

The info about the table is :
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Rank             500 non-null    int64
 1   Name             500 non-null    object
 2   Total_Net_Worth  500 non-null    object
 3   LastChange       500 non-null    object
 4   YTDChange        500 non-null    object
 5   Country          500 non-null    object
 6   Industry         500 non-null    object
dtypes: int64(1), object(6)
memory usage: 27.5+ KB

In [5]:
print("The shape of the table is : ")
df.shape

The shape of the table is :

(500, 7)

In [7]:
print("The top five billionaires are : ")
df.head()

The top five billionaires are :

,Rank,Name,Total_Net_Worth,LastChange,YTDChange,Country,Industry
0,1,Elon Musk,$311B,+$9.32B,+$141B,UnitedStates,Technology
1,2,Jeff Bezos,$195B,-$3.79B,+$5.06B,UnitedStates,Technology
2,3,Bernard Arnault,$167B,-$544M,+$52.7B,France,Consumer
3,4,Bill Gates,$136B,+$906M,+$4.40B,UnitedStates,Technology
4,5,Larry Page,$131B,+$1.71B,+$48.7B,UnitedStates,Technology

In [8]:
print("The last five billionaires are : ")
df.tail()

The last five billionaires are :

,Rank,Name,Total_Net_Worth,LastChange,YTDChange,Country,Industry
495,496,Barry Diller,$5.92B,-$73.5M,+$366M,UnitedStates,Technology
496,497,Cliff Obrecht,$5.89B,$0,+$4.99B,Australia,Services
497,498,Melanie Perkins,$5.89B,$0,+$4.99B,Australia,Services
498,499,Trevor Rees-Jones,$5.89B,-$106M,+$898M,UnitedStates,Energy
499,500,Frits Goldschmeding,$5.88B,-$90.7M,+$621M,Netherlands,Retail

In [9]:
print("The column names are : ")
df.columns

The column names are :

Index(['Rank', 'Name', 'Total_Net_Worth', 'LastChange', 'YTDChange', 'Country',
       'Industry'],
      dtype='object')

In [10]:
print("The index vaues are : ")
df.index

The index vaues are :

RangeIndex(start=0, stop=500, step=1)

In [11]:
df.describe()

             Rank
count  500.000000
mean   250.500000
std    144.481833
min      1.000000
25%    125.750000
50%    250.500000
75%    375.250000
max    500.000000